---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewCurveArrArray
source: html/d2fede56-b61e-cc34-54d9-f7431cc2fdd3.htm
---
# Autodesk.Revit.Creation.Application.NewCurveArrArray Method

Creates an empty array that can store geometric curve loops.

## Syntax (C#)
```csharp
public CurveArrArray NewCurveArrArray()
```

## Returns
The empty array of curve loops.